Repository: jorgedepablo/ProjectUML
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Spanish
es: Español

source: English
es: Inglés

source: Class Diagram
es: Diagrama de Clases

source: Use Case Diagram
es: Diagrama de Casos de Uso

source: Interaction Diagram
es: Diagrama de Interacción

source: Activity Diagram
es: Diagrama de Actividad

source: Deployment Diagram
es: Diagrama de Despliegue

source: Component Diagram
es: Diagrama de Componentes

source: Object Diagram
es: Diagrama de Objetos

source: Package Diagram
es: Diagrama de Paquetes

source: Composite Structure Diagram
es: Diagrama de Estructura Compuesta

source: State Machine Diagram
es: Diagrama de Máquina de Estados

source: This type of diagrams provides the mechanisms to define the structure of a static system. It shows the classes of the system, their attributes, methods and the relationships and between the objects.
es: Este tipo de diagramas proporciona los mecanismos para definir la estructura de un sistema estático. Muestra las clases del sistema, sus atributos, métodos y las relaciones y entre los objetos.

source: A use case diagram is a graphical depiction of a user's possible interactions with a system. A use case diagram shows various use cases and different types of users the system has and will often be accompanied by other types of diagrams as well.
es: Un diagrama de casos de uso es una representación gráfica de las interacciones posibles con un sistema. Un diagrama de casos de uso muestra variados casos de uso y diferentes tipos de usuarios que el sistema tiene y a menudo se acompaña de otros tipos de diagramas también.

source: The purpose of interaction diagrams is to visualize the interactive behavior of the system. Visualizing the interaction is a difficult task. Hence, the solution is to use different types of models to capture the different aspects of the interaction.
es: El objetivo de diagramas de interacción es visualizar el comportamiento interactivo del sistema. Visualizar la interacción es una tarea difícil. Por lo tanto, la solución es utilizar diferentes tipos de modelos para capturar las diferentes aspectos de la interacción.

source: A flowchart is a type of diagram that represents a workflow or process. A flowchart can also be defined as a diagrammatic representation of an algorithm, a step-by-step approach to solving a task. The flowchart shows the steps as boxes of various kinds, and their order by connecting the boxes with arrows. This diagrammatic representation illustrates a solution model to a given problem.
es: Un diagrama de flujo es un tipo de diagrama que representa un flujo de trabajo o un proceso. Un diagrama de flujo también se define como una representación diagramática de un algoritmo, una aproximación paso-a-paso a resolver un problema. El diagrama de flujo muestra los pasos como cajas de varios tipos, y su orden por conectar las cajas con flechas. Esta representación diagramática ilustra un modelo de solución a un problema dado.

source: This type of diagram shows the execution architecture of a system, including the hardware execution environments and software execution environments and the middleware that connects them. It mainly helps to understand and model the hardware topology of a system and how it is deployed.
es: Esta clase de diagrama muestra la arquitectura de ejecución de un sistema, incluyendo los entornos de ejecución de hardware o software y el middleware que los conecta. Principalmente ayudan a entender y modelar la topología hardware de un sistema y como se despliega.

source: The diagrams of components represent a software system divided into components and shows the dependencies between the components. They are really useful to see what components can share between systems or between different parts of a system.
es: Los diagramas de componentes representan un sistema software dividido en componentes y muestra las dependencias entre los componentes. Son realmente útiles para ver qué componentes pueden compartirse entre sistemas o entre diferentes partes de un sistema.

source: This kind of diagrams offers a partial or complete view of the objects of a system. They are diagrams of instances that include objects and data. These diagrams are linked to the class diagrams, showing the state of the system at a certain point in time.
es: Este tipo de diagramas ofrece una vista parcial o completa de los objetos de un sistema. Es un gráfico de instancias que incluye objetos y datos. Estos diagramas están ligados a a los diagramas de clases, muestra el estado del sistema en un punto determinado del tiempo.

source: Represents the dependencies between the packages that compose a system. Shows how this is divided into logical groups and the dependencies between those groups. These diagrams show the decomposition of the logical hierarchy of a system.
es: Representa las dependencias entre los paquetes que componen un sistema. Muestra como este está dividido en agrupaciones lógicas y las dependencias entre esas agrupaciones. Estos diagramas muestran la descomposición de la jerarquía lógica de un sistema.

source: This type of diagram shows the internal structure of a class and the relationships and interactions between the different parts of this. Show the role defined for each element and the composed structure as the set of those elements interconnected.
es: Esta clase de diagrama muestra la estructura interna de una clase y las relaciones e interacciones entre las distintas partes esta. Muestran el rol definido que tiene cada elemento y la estructura compuesta como el conjunto de esos elementos interconectados.

source: A State Machine Diagram, known in some cases as a state diagram, models the behavior of an object. It specifies the sequence of events that occur during the execution of this object.
es: Un diagrama de máquina de estados, conocidos en ocasiones como diagrama de estados modela el comportamiento de un objeto. Especifican la secuencia de eventos que sufre este determinado objeto durante su tiempo de ejecución.

source: send
es: enviar

source: CREATE CHALLENGE
es: CREAR DESAFÍO

source: Fill in the form to upload a challenge
es: Rellena el formulario para subir un reto

source: Challenge Name:
es: Nombre del reto:

source: Enter Challenge Name
es: Introduce el Nombre del Reto

source: Question:
es: Pregunta:

source: Answer:
es: Respuesta:

source: Enter Challenge Answer
es: Introduce la Respuesta del Reto

source: Choose the type of the UML diagram:
es: Elige el tipo de diagrama UML:

source: Choose the image of the UML diagram:
es: Elige la imagen del diagrama UML:

source: Set the points of the challenge:
es: Establece los puntos del reto:

source: Enter Challenge Points (1 to 10)
es: Introduce los Puntos del Reto (1 a 10)

source: upload challenge
es: subir reto

source: CREATE GAME
es: CREAR UN JUEGO

source: Add Gamnes
es: Añade Juegos

source: Game Title
es: Título del Juego

source: Enter Game Name
es: Introduce el Nombre del Juego

source: Choose one or more challenge for your games.
es: Elige uno o más retos para tu juego.

source: upload game
es: subir juego

source: START!
es: ¡EMPEZAR!

source: Have fun, train and learn about Unified Modeling Language
es: Divierte, entrena y aprende sobre Lenguaje Unificado Modelado

source: You can login for more features!
es: ¡Puedes iniciar sesión para más funcionalidades!

source: Click here
es: Haz click aquí

source: PROFILE
es: PERFIL

source: Hello,
es: Bienvenido,

source: Points:
es: Puntos:

source: UPLOAD CHALLENGE
es: SUBIR DESAFÍO

source: CREATE A GAME!
es: ¡CREA UN JUEGO!

source: Logout
es: Cerrar sesión

source: LOGIN
es: INICIAR SESIÓN

source: Please login to see this page.
es: Por favor, inicia sesión para ver esta página.

source: Your username and password didn`t match. Please try again.
es: Tu nombre de usuario y contraseña no coinciden. Por favor, inténtalo de nuevo.

source: login
es: Iniciar sesión

source: Init the gymkhana app...
es: Iniciando gymkhana app...

source: NO GAMES TO PLAY :(
es: NINGÚN JUEGO AL QUE JUGAR :(

source: CONGRATS, CORRECT ANSWER !!
es: ENHORABUENA, TU RESPUESTA ES CORRECTA !!

source: You`ve finished this gymkhana. Let`s go for more games :)
es: Has terminado esta gymkhana. Vamos a por otros retos :)

source: Return to gymkhana app
es: Volver a la gymkhana

source: Let`s go for the next challenge. :)
es: Vamos a por el siguiente reto :)

source: Next Challenge
es: Siguiente Reto

source: WRONG ANSWER
es: RESPUESTA INCORRECTA

source: Sorry, but you can always try again. :)
es: Lo siento, pero siempre puedes volver a intentarlo :)

source: Return to the challenge
es: Volver al reto

source: or
es: o
